duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_20250329/src/communicate/communicate.c
		if(!flag)
			continue;
		
		//step
		for(j=0;j<24;j++)
		{
			uint16_t calorie,distance;
			
			memset(tmpbuf,0,sizeof(tmpbuf));
			
			if(step_data[j] == 0xffff)
				step_data[j] = 0;

			distance = 0.7*step_data[j];
			calorie = (0.8214*60*distance)/1000;
			sprintf(tmpbuf, "%d&%d&%d", step_data[j], distance, calorie);

			if(j<23)
				strcat(tmpbuf,"|");
			else
				strcat(tmpbuf,",");
			strcat(reply, tmpbuf);
		}
		strcat(reply, step_time);
		strcat(reply, ",");
		
		//sleep
		for(j=0;j<24;j++)
		{
			uint16_t total_sleep;
			
			memset(tmpbuf,0,sizeof(tmpbuf));
			
			if(sleep[j].deep == 0xffff)
				sleep[j].deep = 0;
			if(sleep[j].light == 0xffff)
				sleep[j].light = 0;

			total_sleep = sleep[j].deep+sleep[j].light;
			sprintf(tmpbuf, "%d&%d&%d", total_sleep, sleep[j].light, sleep[j].deep);

			if(j<23)
				strcat(tmpbuf,"|");
			else
				strcat(tmpbuf,",");
			strcat(reply, tmpbuf);
		}
		strcat(reply, sleep_time);

		NBSendMissSportData(reply, strlen(reply));
	}
}
#endif

#if defined(CONFIG_PPG_SUPPORT)||defined(CONFIG_TEMP_SUPPORT)
static uint8_t databuf[PPG_REC2_MAX_DAILY*sizeof(bpt_rec2_nod)] = {0};
/*****************************************************************************
 * FUNCTION
 *  SendMissingHrData
 * DESCRIPTION
 *  补发漏传的健康数据心率包(不补发当天的数据，防止固定的23点的时间戳造成当天数据混乱)
 * PARAMETERS
 *	Nothing
 * RETURNS
 *  Nothing
 *****************************************************************************/
void SendMissingHrData(void)
{
	uint16_t i,j,len;
	uint8_t tmpbuf[32] = {0};
	hr_rec2_nod *p_hr;
	sys_date_timer_t temp_date = {0};

	memcpy(&temp_date, &date_time, sizeof(sys_date_timer_t));
	DateDecrease(&temp_date, 6);
	
	for(i=0;i<7;i++)
	{
		bool flag = false;
		uint8_t hr_time[15] = {0x30};
		uint8_t reply[2048] = {0};

		memset(&databuf, 0x00, sizeof(databuf));
		GetGivenDayHrRecData(temp_date, &databuf);
		p_hr = (hr_rec2_nod*)databuf;
		for(j=0;j<PPG_REC2_MAX_DAILY;j++)
		{
		  	if((p_hr->year == 0xffff || p_hr->year == 0x0000)
				||(p_hr->month == 0xff || p_hr->month == 0x00)
				||(p_hr->day == 0xff || p_hr->day == 0x00)
				||(p_hr->hour == 0xff || p_hr->min == 0xff)
				)
			{
				break;
			}

			if(!flag)
			{
				flag = true;
				sprintf(hr_time, "%04d%02d%02d230000", p_hr->year, p_hr->month, p_hr->day);
			}

			memset(tmpbuf,0,sizeof(tmpbuf));
			sprintf(tmpbuf, "%04d%02d%02d%02d%02d;", p_hr->year, p_hr->month, p_hr->day, p_hr->hour, p_hr->min);
			strcat(reply, tmpbuf);
			sprintf(tmpbuf, "%d|", p_hr->hr);
			strcat(reply, tmpbuf);
			
			p_hr++;
		}

		len = strlen(reply);
		if(len > 0)
		{
			reply[len-1] = ',';
			strcat(reply, hr_time);
			NBSendMissHrData(reply, strlen(reply));
		}

		DateIncrease(&temp_date, 1);
	}
}

/*****************************************************************************
 * FUNCTION
 *  SendMissingSpo2Data
 * DESCRIPTION
 *  补发漏传的健康数据血氧包(不补发当天的数据，防止固定的23点的时间戳造成当天数据混乱)
 * PARAMETERS
 *	Nothing
 * RETURNS
 *  Nothing
 *****************************************************************************/
void SendMissingSpo2Data(void)
{
	uint16_t i,j,len;
	uint8_t tmpbuf[32] = {0};
	spo2_rec2_nod *p_spo2;
	sys_date_timer_t temp_date = {0};

	memcpy(&temp_date, &date_time, sizeof(sys_date_timer_t));
	DateDecrease(&temp_date, 6);
	
	for(i=0;i<7;i++)
	{
		bool flag = false;
		uint8_t spo2_time[15] = {0x30};
		uint8_t reply[2048] = {0};

		memset(&databuf, 0x00, sizeof(databuf));
		GetGivenDaySpo2RecData(temp_date, &databuf);
		p_spo2 = (spo2_rec2_nod*)databuf;
		for(j=0;j<PPG_REC2_MAX_DAILY;j++)
		{
			if((p_spo2->year == 0xffff || p_spo2->year == 0x0000)
				||(p_spo2->month == 0xff || p_spo2->month == 0x00)
				||(p_spo2->day == 0xff || p_spo2->day == 0x00)
				||(p_spo2->hour == 0xff || p_spo2->min == 0xff)
				)
			{
				break;
			}

			if(!flag)
			{
				flag = true;
				sprintf(spo2_time, "%04d%02d%02d230000", p_spo2->year, p_spo2->month, p_spo2->day);
			}

			memset(tmpbuf,0,sizeof(tmpbuf));
			sprintf(tmpbuf, "%04d%02d%02d%02d%02d;", p_spo2->year, p_spo2->month, p_spo2->day, p_spo2->hour, p_spo2->min);
			strcat(reply, tmpbuf);
			sprintf(tmpbuf, "%d|", p_spo2->spo2);
			strcat(reply, tmpbuf);
			
			p_spo2++;
		}

		len = strlen(reply);
		if(len > 0)
		{
			reply[len-1] = ',';
			strcat(reply, spo2_time);
			NBSendMissSpo2Data(reply, strlen(reply));
		}

		DateIncrease(&temp_date, 1);
	}
}

/*****************************************************************************
 * FUNCTION
 *  SendMissingBptData
 * DESCRIPTION
 *  补发漏传的健康数据血压包(不补发当天的数据，防止固定的23点的时间戳造成当天数据混乱)
 * PARAMETERS
 *	Nothing
 * RETURNS
 *  Nothing
 *****************************************************************************/
void SendMissingBptData(void)
{
	uint16_t i,j,len;
	uint8_t tmpbuf[32] = {0};
	bpt_rec2_nod *p_bpt;
	sys_date_timer_t temp_date = {0};

	memcpy(&temp_date, &date_time, sizeof(sys_date_timer_t));
	DateDecrease(&temp_date, 6);

	for(i=0;i<7;i++)
	{
		bool flag = false;
		uint8_t bpt_time[15] = {0x30};
		uint8_t reply[2048] = {0};

		memset(&databuf, 0x00, sizeof(databuf));
		GetGivenDayBptRecData(temp_date, &databuf);
		p_bpt = (bpt_rec2_nod*)databuf;
		for(j=0;j<PPG_REC2_MAX_DAILY;j++)
		{
			if((p_bpt->year == 0xffff || p_bpt->year == 0x0000)
				||(p_bpt->month == 0xff || p_bpt->month == 0x00)
				||(p_bpt->day == 0xff || p_bpt->day == 0x00)
				||(p_bpt->hour == 0xff || p_bpt->min == 0xff)
				)
			{
				break;
			}

			if(!flag)
			{
				flag = true;
				sprintf(bpt_time, "%04d%02d%02d230000", p_bpt->year, p_bpt->month, p_bpt->day);
			}

			memset(tmpbuf,0,sizeof(tmpbuf));
			sprintf(tmpbuf, "%04d%02d%02d%02d%02d;", p_bpt->year, p_bpt->month, p_bpt->day, p_bpt->hour, p_bpt->min);
			strcat(reply, tmpbuf);
			sprintf(tmpbuf, "%d&%d|", p_bpt->bpt.systolic, p_bpt->bpt.diastolic);
			strcat(reply, tmpbuf);
			
			p_bpt++;
		}

		len = strlen(reply);
		if(len > 0)
		{
			reply[len-1] = ',';
			strcat(reply, bpt_time);
			NBSendMissBptData(reply, strlen(reply));
		}

		DateIncrease(&temp_date, 1);
	}
}


/*****************************************************************************
 * FUNCTION
 *  SendMissingTempData
 * DESCRIPTION
 *  补发漏传的健康数据体温包(不补发当天的数据，防止固定的23点的时间戳造成当天数据混乱)
 * PARAMETERS
 *	Nothing
 * RETURNS
 *  Nothing
 *****************************************************************************/
void SendMissingTempData(void)
{
	uint16_t i,j,len;
	uint8_t tmpbuf[32] = {0};
	temp_rec2_nod *p_temp;
	sys_date_timer_t temp_date = {0};

	memcpy(&temp_date, &date_time, sizeof(sys_date_timer_t));
	DateDecrease(&temp_date, 6);	

